do 

function run(msg, matches) 
  return [[ الان تم عرض لك اوامر العامه
⚙سورس بروين⚙ @BRWUEN
⚠️▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁⚠️
▨ الرابط 🎲 {لُْعرَضُ الُرَابّطِ}
▨ معلوماتي 🎲 {لُْعرَضُ مٌَْعلُوَمٌاتْكِ}
▨ موقعي 🎲 {لُْعرَضُ مٌوَقًْعكِ}
▨ المكتومين 🎲 {لُْعرَضٌُ مٌكِتْوَمٌيَنَ}

⊞ ملصق 🍄 {تْحُوَيَلُ صّوَرَةِ الُى مٌلُصّقً}
⊞ صوره 🍄 {تْحُوَيَلُ مٌلُصّقً الُى صّوَرَةِ}
⊞ الايدي 🍄 {لُْعرَضُ ايَدِيَ مٌجْمٌوَْعُه}
⊞ القوانين 🍄 {لُْعرَضُ الُقًوَانَيَنَ}

⊟ ايدي الاعضاء 🐲 {لُْعرَظٌ ايَدِيَُهمٌ}
⊟ صوت+كتابه 🐲 {لُتْحُوَيَلُُها بّصّمٌُه}
⊟ ضع تكرار 🐲 {لُوَضُْع مٌنَ 5-25}
⊟ بلوك 🐲 {لُلُطٌِرَدِ}

⊠ معلومات المجموعه 🐻{لُْعرَضُ مٌْعلُوَمٌاتْ}
⊠ /العمل 🐻 {الُارَسِالُهُ الُيَكَِ}
⊠ السورس 🐻 {لُْعرَضُ مٌْعلُوَمٌاتْ سِوَرَسِ}
⊠ امسح+العدد 🐻 {لُمٌسِحُ الُرَسِائلُ}
⚠️▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁⚠️
تابع قناتنا للبوتات @dev_boots
]] 

end 

return { 
description = "#5", 
usage = "#5", 
patterns = { 
"^(#5)$", 
}, 
run = run 
} 
end