do 

function run(msg, matches) 
  return [[ الان تم عرض لك اوامر المطور
⚙سورس بروين⚙ @BRWUEN
⚠️▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁⚠️
〠 تفعيل ☂ {تْفَْعيَلُ بّوَتْ}
〠 تعطيل ☂ {تْْعطِيَلُ بّوَتْ}
〠 ترقيه سوبر ☂ {تْرَقًيَُه مٌجْمٌوَْعُه}
〠 كشف بوت ☂ {كِشِفَ بّوَتْاتْ}

✇ اضف مطور 🐧 {اضُافَُه مٌطِوَرَ}
✇ الملفات 🐧 {لُْعرَضُ مٌلُفَاتْ}
✇ تفعيل ملف 🐧 {تْفَْعيَلُُه لُلُبّوَتْ}
✇تعطيل ملف 🐧 {تْْعطِيَلُُه لُلُبّوَتْ}

❉ الملفات المفعله 🌳 {ْلُعرَضُ مٌلُفَاتْ مٌفَْعلُُه}
❉ كل الاوامر 🌳 {لُْعرَضُ اوَامٌرَ مٌلُفَاتْ}
❉ جلب ملف 🌳 {جْلُبّ مٌلُفَ}
❉ صنع مجموعه 🌳 {لُصّنَْعُها}

❈ طرد البوت ☀️ {لُطِرَدِ الُبّوَتْ}
❈ معلومات السيرفر ☀️ {لُْعرَظٌُها}
❈ اضافه+معرف ☀️ {لُاضُافَُه ْعضُوَ}
❈ تفعيل لمده+مده ☀️ {لُلُتْفَْعيَلُ بّلُمٌدِةِ}
⚠️▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁⚠️
تابع قناتنا للبوتات @dev_boots

]] 

end 

return { 
description = "#6", 
usage = "#6", 
patterns = { 
"^(#6)$", 
}, 
run = run 
} 
end