do 

local function run(msg, matches) 

local reply_id = msg['id'] 
if is_momod(msg) and matches[1] == '#1' then 
    local ghost = [[ 
  🔧 اوامر حماية المجموعه  🔧

🔘➖☑️➖🔘➖☑️➖🔘➖☑️
‼️ قفل الروابط   —-  لقفل الروابط  🔞🔐
‼️  فتح الروابط  —-  لفتح الروابط 🔞 🔓
‼️  قفل الصوت  —-  لقفل الصوتيات 🎵 🔐
‼️  فتح الصوت  —-  لفتح الصوتيات 🎵 🔓
‼️ قفل الصور   —-  لقفل الصور 🌌 🔐
‼️  فتح الصور  —-  لفتح الصور 🌌 🔓
‼️  قفل الفيديو   —-  لقفل الفيديو 📽 🔐
‼️  فتح الفيديو  —-  لفتح الفيديو 🎥 🔓
‼️  قفل الملصقات  —-  لقفل الملصقات 🎡 🔐
‼️  فتح الملصقات  —-  لفتح الملصقات 🎡  🔓
‼️  قفل التكرار  —-  لقفل التكرار ♻️ 🔐 
‼️  فتح التكرار  —-  لفتح التكرار‍ ♻️ 🔓
‼️  قفل الكلايش   —-  لقفل التفليش ☠ 🔐
‼️  فتح الكلايش  —-  لفتح التفليش ☠ 🔓
‼️  قفل الاضافه   —-  لقفل الاضافه  👤 🔐
‼️  فتح الاضافه  —-  لفتح الاضافه 👥 🔓
‼️  قفل العربيه —-  لقفل اللغة العربية  📖 🔐
‼️  فتح العربيه —-  لفتح العربيه  📖🔓
‼️  قفل المجموعة  —-  لوضع المجموعة في وضع الصامت 🔇 ❎
‼️  فتح المجموعة  —-  لالغاء الصامت في المجموعة 🔊✅
‼️  قفل اعاده توجيه  —-  لقفل التوجيه🔃  🔐
‼️  فتح اعاده توجيه   —-  لفتح التوجيه 🔃  🔓
‼️  قفل الصور المتحركه  —-  لقفل المتحركة 💠 🔐 
‼️  فتح الصور المتحركه   —-  لفتح المتحركه 💠 🔓
☑️➖🔘➖☑️➖🔘➖☑️➖🔘

جميع الاوامر تعمل بدون 🔧⛓ {#/!}  💯 
▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁▁ 
🎿ᗦЄᏤ:: @Hassonnyy 🎗 
🎿ᗦЄᏤ:: @BRWUEN 🎗 
🎪ℂⴼ:: @dev_boots 🎗 
  ]] 
  reply_msg(reply_id, ghost, ok_cb, false) 
end 

local reply_id = msg['id'] 
if not is_momod(msg) then 
local ghost = "Only Owner or Mod !" 
reply_msg(reply_id, ghost, ok_cb, false) 
end 

end 
return { 
patterns ={ 
  "^(#1)$", 
}, 
run = run 
} 
end 
