-- made by { @BRWUEN }
do
ws = {}
rs = {}

-- some examples of how to use this :3
ws[1] = "هلاو" 
rs[1] = "هلاوو99وووات نورت/ي ❤️🙈" 

ws[2] = "هلو" -- msg
rs[2] = "هلاوات 🙈❤️" -- reply

ws[3] = "شلونكم" -- msg
rs[3] = "الحمدلله وانته 🌚🍃" -- reply

ws[4] = "دووم" -- msg 
rs[4] = "يدوم نبضك ❤️🍃" -- reply

ws[5] = "شونك"
rs[5] = "الحمدلله وانته"

ws[6] = "شلونك"
rs[6] = "الحمدلله وانته"

ws[7] = "غنيلي"
rs[7] = " 🙈 احبك اني 🙊 اني احبك 🙉 واتحدى واحد بلبشر مثلي يحبك 🙊"

ws[8] = "شغل المبردة"
rs[8] = " تم تشغيل المبردة بنجاح ❄️"

ws[9] = "طفي المبردة"
rs[9] = "طفيتهه 😒🍃"

ws[10] = "شغل السبلت"
rs[10] = "شغلته 🌚🍃 بس حثلجون معليه ترا "

ws[11] = "مايا خليفه"
rs[11] = " 😂 عيب صايمين"

ws[12] = "فطور"
rs[12] = "واخيراً 😍😍 خل اروح افطر "

ws[13] = "الزمة الية"
rs[13] = "لزمتة ح تنيجو انت "

ws[14] = "بوبي"
rs[14] = " 😕💔 نعم حبي "

ws[15] = "تخليني"
rs[15] = " 😂 يي امين ابدي "

ws[16] = "زاحف"
rs[16] = "😂🌚 هاي عود انته جبير"

ws[17] = "تركيا"
rs[17] = "😐🍃 فديتهه"

ws[18] = "داعش"
rs[18] = "دي خل يولون 😒❤️"

ws[19] = "الدولة الاسلامية"
rs[19] = "انته داعشي ؟؟ 😒💔"

ws[20] = "سني"
rs[20] = "لتصير طائفي 😒🖐"

ws[21] = "شيعي"
rs[21] = "لتصير طائفي 😕"

ws[22] = "تبادل"
rs[22] = "كافي ملينه 😒😒 ما اريد اتبادل"

ws[23] = "العراقيين"
rs[23] = "احلى ناس ولله 😍🙈"

ws[24] = "من وين"
rs[24] = "شعليك زاحف 😂🔥 "

ws[25] = "هاي"
rs[25] = "هايات 🙈🍷"

ws[26] = "البوت"
rs[26] = "معاجبك ؟ 😕😒🍃"

ws[27] = "البوت واكف"
rs[27] = "لتجذب 😒"

ws[28] = "منو ديحذف رسائلي"
rs[28] = "محد 😐🍃"

ws[29] = "كلاش اوف كلانس"
rs[29] = "تلعبهه ؟ شكد لفلك ؟"

ws[30] = "جوني"
rs[30] = "😂 مأذيك ؟"

ws[31] = "ازحف "
rs[31] = " على اختك ازحف 🌚🍃 "

ws[32] = "صباحوو"
rs[32] = "صباح العسل يا عسل😻👋"

ws[33] = "مساؤؤ"
rs[33] = "مساء الياسمين😻🙈"

ws[34] = "جرو"
rs[34] = "كلمن يشوف الناس بعين طبعة🙂🎈"

ws[35] = "فرخ"
rs[35] = "كلمن يشوف الناس بعين طبعة🙂🎈"

ws[37] = "فارغ"
rs[37] = "كلمن يشوف الناس بعين طبعة🙂🎈"

ws[38] = "فروخ"
rs[38] = "كلمن يشوف الناس بعين طبعة🙂🎈"

ws[39] = "المنصور"
rs[39] = " احلى ناس ولله "

ws[40] = "المدرسه"
rs[40] = " 😒🍃 الله لا يراوينه "

ws[41] = "تحبني"
rs[41] = " هوايه 😍🙈😍"

ws[42] = "يعني شكد"
rs[42] = " فوك متتوقع "

ws[43] = "😂"
rs[43] = " دوم حبي ❤️"

ws[44] = "هههه"
rs[44] = " دوم حبي ❤️"

ws[45] = "ههههه"
rs[45] = " دوم حبي ❤️"

ws[46] = "😹"
rs[46] = " دوم حبي ❤️"

ws[47] = "🌚"
rs[47] = " منور صخام الجدر 🌚🍃"

ws[48] = "😍"
rs[48] = " مح فديتك"

ws[49] = "مح"
rs[49] = " فوديتك❤️"

ws[50] = "انمي"
rs[50] = " اته اوتاكو ؟ ❤️"

ws[51] = "منحرف"
rs[51] = " وينه حطرده 🌚🌚"

ws[52] = "😭"
rs[52] = " 😢😢 لتبجي"

ws[53] = "😢"
rs[53] = " لتبجي 😭😭"

ws[54] = "شكد عمرك"
rs[54] = "زاحفه 😂😂"

ws[55] = "شكد عمرج"
rs[55] = " زاحف 😂"

ws[56] = "اقرالي دعاء"
rs[56] = " اللهم عذب المدرسين 😢 منهم الاحياء والاموات 😭🔥 اللهم عذب ام الانكليزي 😭💔 وكهربها بلتيار الرئيسي 😇 اللهم عذب ام الرياضيات وحولها الى غساله بطانيات 🙊 اللهم عذب ام الاسلاميه واجعلها بائعة الشاميه 😭🍃 اللهم عذب ام العربي وحولها الى بائعه البلبي اللهم عذب ام الجغرافيه واجعلها كلدجاجه الحافية اللهم عذب ام التاريخ وزحلقها بقشره من البطيخ وارسلها الى المريخ اللهم عذب ام الاحياء واجعلها كل مومياء اللهم عذب المعاون اقتله بلمدرسه بهاون 😂😂😂"

ws[57] = "غبي"
rs[57] = " انته الاغبى"

ws[58] = "دي"
rs[58] = " هاي عود انته جبير 😐😂"

ws[59] = "منو حبيبك"
rs[59] = " اختك 🙈"

ws[60] = "تكرهني"
rs[60] = " يي 😈"

ws[61] = "اكرهك"
rs[61] = " علساس اني احبك تهي بهي 😒🍃"

ws[62] = "😂"
rs[62] = " دوم حبي ❤️"

ws[63] = "الاعضميه"
rs[63] = " احسن ناس وربي❤️"

ws[64] = "الكرادة"
rs[64] = " احسن ناس وربي❤️"

ws[65] = "شارع فلسطين"
rs[65] = " احسن ناس وربي❤️"

ws[66] = "ببكن ملف"
rs[66] = " دي تحلم 😒😒"

ws[67] = "😇"
rs[67] = " اته مو ملاك اته جهنم بنفسهه 😂"

ws[68] = "😐"
rs[68] = " شبيك صافن 😒🔥"

ws[69] = "انجب"
rs[69] = " وك 😢😞"

ws[70] = "حارة"
rs[70] = "يي كولش 😭🍃🔥"

ws[71] = "خالتك"
rs[71] = " راح اطردك لك 😒"

ws[72] = "اطرد البوت"
rs[72] = " راح ابقة احترمك❤️"

ws[73] = "هه"
rs[73] = " شدتحس"

ws[74] = "شدتحس"
rs[74] = " داحس بيك"

ws[75] = "اكولك"
rs[75] = " لتكول 😐😂"

ws[76] = "اكلك"
rs[76] = " لتكول 😐😂"

ws[78] = "بغداد"
rs[78] = " 😍 فديتهه"

ws[79] = "البصرة"
rs[79] = " احسن ناس وربي❤️"

ws[80] = "تركماني"
rs[80] = " والنعم منك❤️"

ws[81] = "يا سورس هذا"
rs[81] = "ديف بوينت"

ws[83] = "باي"
rs[83] = " بايات ❤️🍃"

ws[84] = "تنح"
rs[84] = "عيب ابني 😒🍃"

ws[85] = "جوعان"
rs[85] = "تعال اكلني 😐😂"

ws[86] = "عطشان"
rs[86] = "روح اشرب مي"

ws[87] = "صايم"
rs[87] = "شسويلك 😐🍃"

ws[88] = "☹️"
rs[88] = "لضوج حبيبي 😢❤️🍃"

ws[89] = "😔"
rs[89] = " ليش الحلو ضايج ❤️🍃"

ws[90] = "كسي"
rs[90] = "امشي لك حدث🙂🎈"

ws[92] = "كسمك"
rs[92] = "امشي لك حدث🙂🎈"

ws[93] = "نعال"
rs[93] = " بوجهك 😐😂"

ws[94] = "حروح اسبح"
rs[94] = " واخيراً 😂"

ws[95] = "حروح اغسل"
rs[95] = " واخيراً 😂"

ws[96] = "حروح اطب للحمام"
rs[96] = " واخيراً 😂"

ws[97] = "حبيبتي"
rs[97] = " منو هاي 😱 تخوني 😔☹"

ws[98] = "كبلت"
rs[98] = " بلخير 😂💔"

ws[99] = "البوت عاوي"
rs[99] = " اطردك ؟ 😒"

ws[100] = "منور"
rs[100] = " بنورك حبي 😍🍷"

ws[101] = "حفلش"
rs[101] = " افلش راسك"

ws[102] = "كردي"
rs[102] = "والنعم منك ❤️"

ws[103] = "طفي السبلت"
rs[103] = " تم اطفاء السبلت بنجاح 🌚🍃"

ws[104] = "🌝"
rs[104] = "هه"

ws[105] = "اذن المغرب"
rs[105] = "استحرم 🌚🍃"

ws[106] = "حلو"
rs[106] = "انت الاحلى 🌚❤️"

ws[107] = "احبك"
rs[107] = " اني اكثر 😍🍃"

ws[108] = "😑"
rs[108] = " شبيك 🍃☹"

ws[109] = "😒"
rs[109] = "😐 شبيك كالب وجهك "

ws[110] = "منو تحب"
rs[110] = "خالتك الشكرة"

ws[111] = "اباجر العيد"
rs[111] = "كل عام وانت بالف خير حبي 😇❤️"

ws[112] = "فديت"
rs[112] = "ها  زاحف كمشتك"

ws[113] = "مضغوط"
rs[113] = "دي انضغظ منك ؟ 😂😂"

ws[114] = "فديت"
rs[114] = "ها  زاحف كمشتك"

ws[115] = "فديتك"
rs[115] = "ها  زاحف كمشتك"

ws[116] = "فديتج"
rs[116] = "ها  زاحف كمشتك"

ws[117] = "شوف خاصك"
rs[117] = "شدازله 😱😨"

ws[118] = "تعال خاص"
rs[118] = "شحسوون 😱"

ws[119] = "تعالي خاص"
rs[119] = "شحسوون 😱"

ws[120] = "دخل السبام"
rs[120] = "شحسوون 😱"

ws[121] = "😎"
rs[121] = "يلا عود انته فد نعال 😐🍃"

ws[122] = "😱"
rs[122] = "خير خوفتني 😨"

ws[123] = "كحبه"
rs[123] = "هاي اخكتك حدث😚🎈"

ws[124] = "بيش ساعة"
rs[124] = "ما اعرف 🌚🍃"

ws[125] = "🚶🏻"
rs[125] = "خير 🌝"

ws[126] = "منو اكثر واحد تحبه"
rs[126] = "خالتك"

ws[127] = "ليش"
rs[127] = "تاكل خرة الجيش 😂😂"

ws[128] = "طاسه"
rs[128] = "امك حلوة ورقاصه 💃🏻"

ws[129] = "عشرين"
rs[129] = "تاكل جدر خنين 😫"

ws[130] = "ميه"
rs[130] = "😂تشرب مميه"

ws[131] = "اربعة"
rs[131] = "😂لحيه ابوك مربعه"

ws[132] = "فارة"
rs[132] = "😂دفترك كله صفارة"

ws[133] = "ميتين"
rs[133] = "😂فوك راسك قندرتين"

ws[134] = "مات"
rs[134] = "ابو الحمامات 🐦"

ws[135] = "توفه"
rs[135] = "ابو اللفه 🌯"

ws[136] = "احترك"
rs[136] = "🍾البو العرك"

ws[137] = "غرك"
rs[137] = "ابو العرك 🍾"

ws[138] = "طار"
rs[138] = "ابن الطيار"

ws[139] = "سحك"
rs[139] = "😂😂اي هواي يسحك"

ws[140] = "لتسحك"
rs[140] = "😐😂 وك"

ws[141] = "اندرويد"
rs[141] = "افشل نظام بلعالم 🌝🍷"

ws[142] = "ios"
rs[142] = "احسن نظام بلعالم🌚❤️"

ws[143] = "ايفون"
rs[143] = "فديتك اته والايفون 🌚🔥"

ws[144] = "كلكسي"
rs[144] = "فاشل اخرة نوع تلفون🔥☹"

ws[145] = "سامسونك"
rs[145] = "فاشل اخرة نوع تلفون🔥☹"

ws[146] = "لتزحف"
rs[146] = "وك اسف 🙁😔"

ws[147] = "حاته"
rs[147] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[148] = "حات"
rs[148] = "زاحفه 😂 منو هذا دزيلي صورته"

ws[149] = "صاكه"
rs[149] = "زاحف 😂 منو هاي دزلي صورتهه"

ws[150] = "صاك"
rs[150] = "زاحفه 😂 منو هذا دزيلي صورهه"

ws[151] = "منو اني"
rs[151] = "انته احلى شي بحياتي ❤️🍃"

ws[152] = "ابن الكلب"
rs[152] = "عيب ابني 🔥☹"

ws[153] = "انجب انته"
rs[153] = "وك وك 😭😔"

ws[154] = "حطردك"
rs[154] = "اعصابك 😨 لتتهور"

ws[155] = "المطور"
rs[155] = "شتريد من المطور 😐🍃"

ws[156] = "منو اكثر واحد تكرهه"
rs[156] = "انته"

ws[157] = "شباب"
rs[157] = "نعم حبي 🌝❤️"

ws[158] = "اته زلمه"
rs[158] = "تعال لزمه 😐😂"

ws[159] = "الاحد"
rs[159] = "هذا اليوم نحس بلنسبه الي"

ws[160] = "الاثنين"
rs[160] = "يوم اجة بي ناس عزيزين وفقدت بي ناس هم ☹"

ws[161] = "هلاوو"
rs[161] = "هلاوات ❤️🍃"

ws[162] = "اختك"
rs[162] = "شبيهه 😱"

ws[163] = "كواد"
rs[163] = "عيب 😨😨"

ws[164] = "😌"
rs[164] = "المطلوب ؟"

ws[165] = "هلا"
rs[165] = " 🌚🍃هلاوات"

ws[166] = "مرحبا"
rs[166] = "مرحبتين 😍🍃"

ws[167] = "سلام"
rs[167] = "السلام عليكم 🌝🍃"

ws[168] = "السلام"
rs[168] = "السلام عليكم 🌝🍃"

ws[169] = "السلام عليكم"
rs[169] = "عليكم السلام 🌝🍃"

ws[170] = "تسلم"
rs[170] = "الله يسلمك 😍"

ws[171] = "المعلم"
rs[171] = "😘❤️فديته هاذ الصنعني💋😘"

ws[172] = "عراقي"
rs[172] = "نعم تفضل شتريد😕"

ws[173] = "لتغلط"
rs[173] = "تمشي لك فرجه😢😂"

ws[174] = "شوشو"
rs[174] = "فديت هاي الصاكه"

ws[175] = "فخامت رجل"
rs[175] = "فوديت هاذا الصاك😍😻"

ws[176] = "اتفل"
rs[176] = "خخخخخنفووووو💦💦💦💦💦💦💦💦💦💦"

ws[177] = "شمس"
rs[177] = "هاي الكوريه الصاكه"

ws[178] = "😳"
rs[178] = "❌لـŃØـ😌✋ـ✿ـا❌ تصدم ڪفشةة. ْْعمري. هية.  ✾ هٌـஆــٌُأإي  ٱٳلدنيه👻 "

ws[179] = "شغال"
rs[179] = "ييب😋🙈"

ws[180] = "سبارك"
rs[180] = "تفضل كبد حياتي 💋😜"

ws[181] = "بوسني"
rs[181] = "عيع ما ابوس قرودة😂😌"

ws[182] = "الزاحف"
rs[182] = "زاحف انته شعليك دودة" 

ws[183] = "اتحب اسو" 
rs[183] = "اي غير اموت عليه"

ws[184] = "ابو شيبه حلو"
rs[184] = "يي يخبل و صاك فديتة و فديت رقمة ليوزعه😂😢"

ws[185] ="حسين"
rs[185] ="هاذا ضلع مايسترو صكاركم مح فديته😻🎈" 

ws[186] ="مايسترو"
rs[186] ="هاذا عشقي و بطور بلفاتي😻🙈"

ws[187] ="اغير جو" 
rs[187] = "😂 تغير جو لو تسحف 🐍 عل بنات"

ws[188] ="ختصبه"
rs[188] ="تنح حبيبي تنح حختصبك🌚🍃"

ws[189] ="روح"
rs[189] ="هَـHaــاآ يعيون روح😻🙈"

ws[190] ="ترللي"
rs[190] ="هاذا العشق مال اني😍🙈"

ws[191] ="علي"
rs[191] ="هاذا النفس مالي😻🔥"
ws[192] ="ذي قار" --msg
rs[192] ="احسن ناس وربي❤️" --reply




-- the main function
function run( msg, matches )
-- just a local variables that i used in my algorithm 
local i = 0; local w = false

-- the main part that get the message that the user send and check if it equals to one of the words in the ws table :)
-- this section loops through all the words table and assign { k } to the word index and { v } to the word itself 
for k,v in pairs(ws) do
-- change the message text to uppercase and the { v } value that toke form the { ws } table and than compare it in a specific pattern 
if ( string.find(string.upper(msg.text), "^" .. string.upper(v) .. "$") ) then
-- assign the { i } to the index of the reply and the { w } to true ( we will use it later )
i = k; w = true;
end
end

-- check if { w } is not false and { i } not equals to 0
if ( (w ~= false) and (i ~= 0) ) then
-- get the receiver :3 
R = get_receiver(msg)
-- send him the proper message from the index that { i } assigned to
--send_large_msg ( R , rs[i] );
--send_reply(msg.id, rs[i])
reply_msg(msg.id, rs[i], ok_cb, false )
end

-- don't edit this section
if ( msg.text == "about" ) then
if ( msg.from.username == "kaastro" ) then
R = get_receiver(msg)
send_large_msg ( R , "Made by @BRWUEN" );
end
end 

end



return {
patterns = {
"(.*)"	
},
run = run
} 


end